tests/load-test.yml
config:
  target: "{{ $processEnvironment.API_URL }}"
  processor: "generator.js"
  phases:
    - duration: 20
      arrivalRate: 10

scenarios:
  - name: "Generate products"
    weight: 8
    flow:
      - function: "generateProduct" 
      - get:
          url: "/" 
  - name: "Testing"
    weight: 2
    flow:
      - get:
          url: "/"